SET @start_value= @@global.log_syslog;
SET @@global.log_syslog= DEFAULT;
SELECT @@global.log_syslog;
@@global.log_syslog
0
SET @@global.log_syslog= 0;
SELECT @@global.log_syslog;
@@global.log_syslog
0
SET @@global.log_syslog= 1;
SELECT @@global.log_syslog;
@@global.log_syslog
1
SET @@global.log_syslog= ON;
SELECT @@global.log_syslog;
@@global.log_syslog
1
SET @@global.log_syslog= OFF;
SELECT @@global.log_syslog;
@@global.log_syslog
0
SET @@global.log_syslog= 9;
ERROR 42000: Variable 'log_syslog' can't be set to the value of '9'
SELECT @@global.log_syslog;
@@global.log_syslog
0
SET GLOBAL log_syslog= 0.01;
ERROR 42000: Incorrect argument type to variable 'log_syslog'
SET SESSION log_syslog= 0;
ERROR HY000: Variable 'log_syslog' is a GLOBAL variable and should be set with SET GLOBAL
SET LOCAL log_syslog= 0;
ERROR HY000: Variable 'log_syslog' is a GLOBAL variable and should be set with SET GLOBAL
SET @@global.log_syslog= @start_value;
